[
{"title": "Bamboo Theatre (2019) - full transcript", "plot": "This film is a portrait of unique cultural space for Spirits, Gods and People. While permanent theatres are commonly built in most cosmopolitan modern cities, Hong Kong preserves a unique theatrical architecture, a Chinese tradition that has lasted more than a century - Bamboo Theatre.", "transcript": [], "url": "https://subslikescript.com/movie/Bamboo_Theatre-11080024"},
{"title": "Bayi Ajaib (1982) - full transcript", "plot": "A diamond mine in the village is the source of competition between Kosim and Dorman. Dorman believes that the soul of his ancestor, Alberto Dominique, who is buried there, will help him achieve his ambition.", "transcript": [], "url": "https://subslikescript.com/movie/Bayi_Ajaib-2494868"},
{"title": "Lovely Man (2011) - full transcript", "plot": "Cahaya (Raihaanun) travels to Jakarta, Indonesia, to search for her father and discovers that he is a prostitute for men.", "transcript": [], "url": "https://subslikescript.com/movie/Lovely_Man-2085865"},
{"title": "A Chump at Oxford (1940) - full transcript", "plot": "With Stan in drag, the boys get jobs as a married butler and maid for a dinner party at the Vandeveres. When that ends in disaster, they're reduced to sweeping streets, and accidentally capture a bank robber. The grateful bank president sends them to Oxford for a proper education. There they become victims of student pranks, getting lost in the university's Maze, and taking over the Dean's quarters as their own; but, then a knock on the head turns Stan \"back\" into the famed Lord Paddington, scholar and athlete extraordinaire. Suddenly erudite and supercilious, he retains Oliver as his valet, \"Fatty.\"", "transcript": [], "url": "https://subslikescript.com/movie/A_Chump_at_Oxford-32339"},
{"title": "Kiri no shigosen (1996) - full transcript", "plot": null, "transcript": [], "url": "https://subslikescript.com/movie/Kiri_no_shigosen-439225"},
{"title": "Golgo 13: The Professional (1983) - full transcript", "plot": "Indestructible to his enemies and irresistible to women, the professional assassin codenamed GOLGO 13 is shrouded in mystery and anonymity. If you're on his hit list your already dead. Always hired on his reputation alone, GOLGO 13 never breaks a contract. But can he survive the combined forces of the FBI, CIA, The Pentagon and the U.S. Army? Has the nameless agent finally met his match against the superhuman powers of the Snake and the twin evils of the psychopathic mercenaries, Gold and Silver?", "transcript": [], "url": "https://subslikescript.com/movie/Golgo_13_The_Professional-86148"},
{"title": "Victoire (2023) - full transcript", "plot": "Victoire Du Sault, founder of the shoemaking business that made the fortune of the Dufresne family, navigates a forbidden love triangle that holds a devastating family secret which threatens to surface and leave a trail of woe in ...", "transcript": [], "url": "https://subslikescript.com/movie/Victoire-23831488"},
{"title": "A Garfield Christmas Special (1987) - full transcript", "plot": "Garfield, Jon, and Odie go to Jon's grandmother's house for Christmas, where Garfield finds a present for Grandma.", "transcript": [], "url": "https://subslikescript.com/movie/A_Garfield_Christmas_Special-302596"},
{"title": "Ang mga kaibigan ni Mama Susan (2023) - full transcript", "plot": "Follows a college student embroiled in a series of mysteries, all that threaten to engulf his young life.", "transcript": [], "url": "https://subslikescript.com/movie/Ang_mga_kaibigan_ni_Mama_Susan-27510021"},
{"title": "Butterfly Vision (2022) - full transcript", "plot": "Returning home from the front line after being held captive for two months, soldier Lilia (29 y.o.) discovers that she is pregnant after being raped by her warden. Will she manage to survive this trauma and save the child in a society that is not ready to accept either of them?", "transcript": [], "url": "https://subslikescript.com/movie/Butterfly_Vision-14867294"},
{"title": "Bikini Hackers (2023) - full transcript", "plot": "A group of women hatch a plan to take down the top global financial systems.", "transcript": [], "url": "https://subslikescript.com/movie/Bikini_Hackers-21419538"},
{"title": "Operation Dance Sensation (2003) - full transcript", "plot": "After escaping from the terror of Vietnam, Jackson works as a headhunter. His old enemies from Vietnam open up a disco near the American-Iraqi border. They try to sell dangerous weapons to ...", "transcript": [], "url": "https://subslikescript.com/movie/Operation_Dance_Sensation-417029"},
{"title": "Jin yu liang yuan hong lou meng (1977) - full transcript", "plot": "Love discovered and lost is but one of the themes of this lavish Shaw Brothers' rendition of an old Chinese tale.Western audiences might find it confusing to find that the male romantic lead, Jia Baoyu, is played by a female-- but this is merely to show an excessive of sensitivity and tenderness, as well as a childlike innocence. And, while it might take a little getting used to, Brigitte Lin does a successful job in pulling it off.The movie plays like an opera. And, indeed, it does share a number of the characteristics of both Western and Chinese opera-- again with great success, but the plot moves along through both dialogue and song. The depths of the emotions chartered here are quite dramatic, and maybe a touch melodramatic, but that is a good representation of human nature, particularly in matters of the heart. There is an invariable drama to love which supersedes all reason. The primary plot of the slow realization of a first, true love is nicely set off by the secondary plot of jealousy and deceit among the family and its servants. It might almost seem heavy-handed, but a strong cast, boasting strong performances cares it off flawlessly.Newly remastered in lavish colors, this film is a true treasure in every sense of the word. Clearly, one of the Shaw Brothers' best.", "transcript": [], "url": "https://subslikescript.com/movie/Jin_yu_liang_yuan_hong_lou_meng-75959"},
{"title": "Robots (2023) - full transcript", "plot": "Charles is a womanizer while Elaine is a gold digger. The duo learn humanity when forced to team up and pursue robot doubles of themselves.", "transcript": [], "url": "https://subslikescript.com/movie/Robots-12579470"},
{"title": "Koroshita no wa dare da (1957) - full transcript", "plot": "A gritty troubled youth drama, fuelled no doubt by the taiyozoku (sun tribe) fever than current.", "transcript": [], "url": "https://subslikescript.com/movie/Koroshita_no_wa_dare_da-50606"},
{"title": "On Our Way (2021) - full transcript", "plot": "A troubled young filmmaker battles a dark voice inside his head; can a mysterious muse illuminate his way out of it?", "transcript": [], "url": "https://subslikescript.com/movie/On_Our_Way-12538996"},
{"title": "Love Child (2014) - full transcript", "plot": "LOVE CHILD is a documentary following of the first tried case of Internet Addiction the world has ever seen. Filmed over two years in Seoul, Korea, the film follows the story of a young couple in South Korea who were immersed in an on line game raising a fairy child and their real life baby died of neglect. The 2010 trial that followed saw the first ever usage of the term 'Internet Addiction' as the young couple's lawyer crafted a mental illness defense. Weaving together footage of the game, interviews and reenactments, LOVE CHILD tells a haunting tale set in a world where virtual is the new reality.", "transcript": [], "url": "https://subslikescript.com/movie/Love_Child-3469420"},
{"title": "The Fence (1994) - full transcript", "plot": "A former con man learns that it's each time more hard to keep in the right path.", "transcript": [], "url": "https://subslikescript.com/movie/The_Fence-109795"},
{"title": "Red Ribbons (1994) - full transcript", "plot": null, "transcript": [], "url": "https://subslikescript.com/movie/Red_Ribbons-244755"},
{"title": "Kadina Kadoramee Andakadaham (2023) - full transcript", "plot": "Bachu, a young man who wishes to become a businessman, is in a big crisis. His family forces him to go to Gulf but he is not ready to change his decision. When lockdown is imposed he rethink his actions.", "transcript": [], "url": "https://subslikescript.com/movie/Kadina_Kadoramee_Andakadaham-22078754"},
{"title": "Maruthi Nagar Police Station (2023) - full transcript", "plot": "Revolve around four close friends seeking revenge for the murder of their friend", "transcript": [], "url": "https://subslikescript.com/movie/Maruthi_Nagar_Police_Station-24724658"},
{"title": "Watson (2019) - full transcript", "plot": "Co-founder of Greenpeace and founder of Sea Shepherd, Captain Paul Watson has spent 40 years fighting to end the destruction of the ocean's wildlife and its habitat.", "transcript": [], "url": "https://subslikescript.com/movie/Watson-10011252"},
{"title": "Nick Capper: Pork Palace (2022) - full transcript", "plot": null, "transcript": [], "url": "https://subslikescript.com/movie/Nick_Capper_Pork_Palace-21961964"},
{"title": "The Sky Crawlers (2008) - full transcript", "plot": "The Kildren, a group of eternally young fighter pilots, experience the sudden loss of innocence as they battle the enemy in astonishing dogfights above the clouds.", "transcript": [], "url": "https://subslikescript.com/movie/The_Sky_Crawlers-1056437"},
{"title": "Cat Daddies (2022) - full transcript", "plot": "David Giovanni is living on the streets of New York, determined to stay together with his beloved cat Lucky. When he's finally granted a spot in a transitional housing facility that accepts cats, the COVID-19 pandemic and a devastating medical diagnosis puts his future together with Lucky in doubt. David's journey is interspersed with portraits of other \"cat dads\" from all over the country and some who struggle to navigate the unprecedented events of 2020 with their little furry friends. They include a group of firefighters, a stunt man, a truck driver, a Bay Area tech worker, a schoolteacher whose cat becomes a viral sensation, and an actor/Instagram influencer. These men couldn't be more different, but they share an unconditional love of their beloved pets. Cat Daddies is a refreshing and timely exploration of modern masculinity and the unlikely bond between man and cat.", "transcript": [], "url": "https://subslikescript.com/movie/Cat_Daddies-10968602"},
{"title": "Love Battlefield (2004) - full transcript", "plot": "Yui and Ching are heading for holiday. But on the day they depart, Yui's car is stolen, sparking off a quarrel between the two which results in separation. Yui is left alone to travel to the airport. But he then discovers his stolen car in which a bandit named Wah is hiding himself. Knowing that Yui works as a nurse, Wah threatens Yui to treat his injured partner. However, the injured partner dies during the operation. Furious, Wah vows to burn Yui to death.", "transcript": [], "url": "https://subslikescript.com/movie/Love_Battlefield-431892"},
{"title": "Luc Van Tien: Tuyet Dinh Kungfu (2017) - full transcript", "plot": "If You are missing fight scenes like the movies from the late 90s then look this movie. Like iron monkey like once upon a time in China like drunken masters. This is a masterpiece from the stunt member of Jackie Chan's stunt team mate.", "transcript": [], "url": "https://subslikescript.com/movie/Luc_Van_Tien_Tuyet_Dinh_Kungfu-6714544"},
{"title": "Karge meri (1981) - full transcript", "plot": "Karge meri (The Smacking Sea) is a film about the work of traditional seal hunters on the smacking Baltic Sea and their life in the coast village. The film is made so realistic that it could be kept even for documentary. Actually, this very slow movie with terrible soundtrack is nothing but traditional Estonian cinema.", "transcript": [], "url": "https://subslikescript.com/movie/Karge_meri-446376"},
{"title": "Turn Around (2017) - full transcript", "plot": "After graduating from Kaohsiung Normal University, Wang Cheng-chung teacher was designated to teach in a rural - Nantou County Zhongliao Township Shuangwen Primary school which was lacking in educational resources. He was prepared to leave after the end of internship but met with the Taiwan 921 earthquake. When the students cried and asked him: \"Teacher, will you be coming back?\" Wang Cheng-chung teacher was deeply inspired by the students and decided to stay with the school which was lacking in resources for the education of rural children and efforts.", "transcript": [], "url": "https://subslikescript.com/movie/Turn_Around-6879340"},
{"title": "The Black Demon (2023) - full transcript", "plot": "Stranded on a crumbling rig in Baja, a family faces off against a vengeful megalodon shark.", "transcript": [], "url": "https://subslikescript.com/movie/The_Black_Demon-10279472"}
]