
{"title": "Bamboo Theatre (2019) - full transcript", "plot": "This film is a portrait of unique cultural space for Spirits, Gods and People. While permanent theatres are commonly built in most cosmopolitan modern cities, Hong Kong preserves a unique theatrical architecture, a Chinese tradition that has lasted more than a century - Bamboo Theatre.", "transcript": [], "url": "https://subslikescript.com/movie/Bamboo_Theatre-11080024"},
{"title": "Bayi Ajaib (1982) - full transcript", "plot": "A diamond mine in the village is the source of competition between Kosim and Dorman. Dorman believes that the soul of his ancestor, Alberto Dominique, who is buried there, will help him achieve his ambition.", "transcript": [], "url": "https://subslikescript.com/movie/Bayi_Ajaib-2494868"},
{"title": "Lovely Man (2011) - full transcript", "plot": "Cahaya (Raihaanun) travels to Jakarta, Indonesia, to search for her father and discovers that he is a prostitute for men.", "transcript": [], "url": "https://subslikescript.com/movie/Lovely_Man-2085865"},
{"title": "A Chump at Oxford (1940) - full transcript", "plot": "With Stan in drag, the boys get jobs as a married butler and maid for a dinner party at the Vandeveres. When that ends in disaster, they're reduced to sweeping streets, and accidentally capture a bank robber. The grateful bank president sends them to Oxford for a proper education. There they become victims of student pranks, getting lost in the university's Maze, and taking over the Dean's quarters as their own; but, then a knock on the head turns Stan \"back\" into the famed Lord Paddington, scholar and athlete extraordinaire. Suddenly erudite and supercilious, he retains Oliver as his valet, \"Fatty.\"", "transcript": [], "url": "https://subslikescript.com/movie/A_Chump_at_Oxford-32339"},
{"title": "Kiri no shigosen (1996) - full transcript", "plot": null, "transcript": [], "url": "https://subslikescript.com/movie/Kiri_no_shigosen-439225"},
{"title": "Golgo 13: The Professional (1983) - full transcript", "plot": "Indestructible to his enemies and irresistible to women, the professional assassin codenamed GOLGO 13 is shrouded in mystery and anonymity. If you're on his hit list your already dead. Always hired on his reputation alone, GOLGO 13 never breaks a contract. But can he survive the combined forces of the FBI, CIA, The Pentagon and the U.S. Army? Has the nameless agent finally met his match against the superhuman powers of the Snake and the twin evils of the psychopathic mercenaries, Gold and Silver?", "transcript": [], "url": "https://subslikescript.com/movie/Golgo_13_The_Professional-86148"},
{"title": "Victoire (2023) - full transcript", "plot": "Victoire Du Sault, founder of the shoemaking business that made the fortune of the Dufresne family, navigates a forbidden love triangle that holds a devastating family secret which threatens to surface and leave a trail of woe in ...", "transcript": [], "url": "https://subslikescript.com/movie/Victoire-23831488"},
{"title": "A Garfield Christmas Special (1987) - full transcript", "plot": "Garfield, Jon, and Odie go to Jon's grandmother's house for Christmas, where Garfield finds a present for Grandma.", "transcript": [], "url": "https://subslikescript.com/movie/A_Garfield_Christmas_Special-302596"},
{"title": "Ang mga kaibigan ni Mama Susan (2023) - full transcript", "plot": "Follows a college student embroiled in a series of mysteries, all that threaten to engulf his young life.", "transcript": [], "url": "https://subslikescript.com/movie/Ang_mga_kaibigan_ni_Mama_Susan-27510021"},
{"title": "Butterfly Vision (2022) - full transcript", "plot": "Returning home from the front line after being held captive for two months, soldier Lilia (29 y.o.) discovers that she is pregnant after being raped by her warden. Will she manage to survive this trauma and save the child in a society that is not ready to accept either of them?", "transcript": [], "url": "https://subslikescript.com/movie/Butterfly_Vision-14867294"},
{"title": "Bikini Hackers (2023) - full transcript", "plot": "A group of women hatch a plan to take down the top global financial systems.", "transcript": [], "url": "https://subslikescript.com/movie/Bikini_Hackers-21419538"},
{"title": "Operation Dance Sensation (2003) - full transcript", "plot": "After escaping from the terror of Vietnam, Jackson works as a headhunter. His old enemies from Vietnam open up a disco near the American-Iraqi border. They try to sell dangerous weapons to ...", "transcript": [], "url": "https://subslikescript.com/movie/Operation_Dance_Sensation-417029"},
{"title": "Jin yu liang yuan hong lou meng (1977) - full transcript", "plot": "Love discovered and lost is but one of the themes of this lavish Shaw Brothers' rendition of an old Chinese tale.Western audiences might find it confusing to find that the male romantic lead, Jia Baoyu, is played by a female-- but this is merely to show an excessive of sensitivity and tenderness, as well as a childlike innocence. And, while it might take a little getting used to, Brigitte Lin does a successful job in pulling it off.The movie plays like an opera. And, indeed, it does share a number of the characteristics of both Western and Chinese opera-- again with great success, but the plot moves along through both dialogue and song. The depths of the emotions chartered here are quite dramatic, and maybe a touch melodramatic, but that is a good representation of human nature, particularly in matters of the heart. There is an invariable drama to love which supersedes all reason. The primary plot of the slow realization of a first, true love is nicely set off by the secondary plot of jealousy and deceit among the family and its servants. It might almost seem heavy-handed, but a strong cast, boasting strong performances cares it off flawlessly.Newly remastered in lavish colors, this film is a true treasure in every sense of the word. Clearly, one of the Shaw Brothers' best.", "transcript": [], "url": "https://subslikescript.com/movie/Jin_yu_liang_yuan_hong_lou_meng-75959"},
{"title": "Robots (2023) - full transcript", "plot": "Charles is a womanizer while Elaine is a gold digger. The duo learn humanity when forced to team up and pursue robot doubles of themselves.", "transcript": [], "url": "https://subslikescript.com/movie/Robots-12579470"},
{"title": "Koroshita no wa dare da (1957) - full transcript", "plot": "A gritty troubled youth drama, fuelled no doubt by the taiyozoku (sun tribe) fever than current.", "transcript": [], "url": "https://subslikescript.com/movie/Koroshita_no_wa_dare_da-50606"},
{"title": "On Our Way (2021) - full transcript", "plot": "A troubled young filmmaker battles a dark voice inside his head; can a mysterious muse illuminate his way out of it?", "transcript": [], "url": "https://subslikescript.com/movie/On_Our_Way-12538996"},
{"title": "Love Child (2014) - full transcript", "plot": "LOVE CHILD is a documentary following of the first tried case of Internet Addiction the world has ever seen. Filmed over two years in Seoul, Korea, the film follows the story of a young couple in South Korea who were immersed in an on line game raising a fairy child and their real life baby died of neglect. The 2010 trial that followed saw the first ever usage of the term 'Internet Addiction' as the young couple's lawyer crafted a mental illness defense. Weaving together footage of the game, interviews and reenactments, LOVE CHILD tells a haunting tale set in a world where virtual is the new reality.", "transcript": [], "url": "https://subslikescript.com/movie/Love_Child-3469420"},
{"title": "The Fence (1994) - full transcript", "plot": "A former con man learns that it's each time more hard to keep in the right path.", "transcript": [], "url": "https://subslikescript.com/movie/The_Fence-109795"},
{"title": "Red Ribbons (1994) - full transcript", "plot": null, "transcript": [], "url": "https://subslikescript.com/movie/Red_Ribbons-244755"},
{"title": "Kadina Kadoramee Andakadaham (2023) - full transcript", "plot": "Bachu, a young man who wishes to become a businessman, is in a big crisis. His family forces him to go to Gulf but he is not ready to change his decision. When lockdown is imposed he rethink his actions.", "transcript": [], "url": "https://subslikescript.com/movie/Kadina_Kadoramee_Andakadaham-22078754"},
{"title": "Maruthi Nagar Police Station (2023) - full transcript", "plot": "Revolve around four close friends seeking revenge for the murder of their friend", "transcript": [], "url": "https://subslikescript.com/movie/Maruthi_Nagar_Police_Station-24724658"},
{"title": "Watson (2019) - full transcript", "plot": "Co-founder of Greenpeace and founder of Sea Shepherd, Captain Paul Watson has spent 40 years fighting to end the destruction of the ocean's wildlife and its habitat.", "transcript": [], "url": "https://subslikescript.com/movie/Watson-10011252"},
{"title": "Nick Capper: Pork Palace (2022) - full transcript", "plot": null, "transcript": [], "url": "https://subslikescript.com/movie/Nick_Capper_Pork_Palace-21961964"},
{"title": "The Sky Crawlers (2008) - full transcript", "plot": "The Kildren, a group of eternally young fighter pilots, experience the sudden loss of innocence as they battle the enemy in astonishing dogfights above the clouds.", "transcript": [], "url": "https://subslikescript.com/movie/The_Sky_Crawlers-1056437"},
{"title": "Cat Daddies (2022) - full transcript", "plot": "David Giovanni is living on the streets of New York, determined to stay together with his beloved cat Lucky. When he's finally granted a spot in a transitional housing facility that accepts cats, the COVID-19 pandemic and a devastating medical diagnosis puts his future together with Lucky in doubt. David's journey is interspersed with portraits of other \"cat dads\" from all over the country and some who struggle to navigate the unprecedented events of 2020 with their little furry friends. They include a group of firefighters, a stunt man, a truck driver, a Bay Area tech worker, a schoolteacher whose cat becomes a viral sensation, and an actor/Instagram influencer. These men couldn't be more different, but they share an unconditional love of their beloved pets. Cat Daddies is a refreshing and timely exploration of modern masculinity and the unlikely bond between man and cat.", "transcript": [], "url": "https://subslikescript.com/movie/Cat_Daddies-10968602"},
{"title": "Love Battlefield (2004) - full transcript", "plot": "Yui and Ching are heading for holiday. But on the day they depart, Yui's car is stolen, sparking off a quarrel between the two which results in separation. Yui is left alone to travel to the airport. But he then discovers his stolen car in which a bandit named Wah is hiding himself. Knowing that Yui works as a nurse, Wah threatens Yui to treat his injured partner. However, the injured partner dies during the operation. Furious, Wah vows to burn Yui to death.", "transcript": [], "url": "https://subslikescript.com/movie/Love_Battlefield-431892"},
{"title": "Luc Van Tien: Tuyet Dinh Kungfu (2017) - full transcript", "plot": "If You are missing fight scenes like the movies from the late 90s then look this movie. Like iron monkey like once upon a time in China like drunken masters. This is a masterpiece from the stunt member of Jackie Chan's stunt team mate.", "transcript": [], "url": "https://subslikescript.com/movie/Luc_Van_Tien_Tuyet_Dinh_Kungfu-6714544"},
{"title": "Karge meri (1981) - full transcript", "plot": "Karge meri (The Smacking Sea) is a film about the work of traditional seal hunters on the smacking Baltic Sea and their life in the coast village. The film is made so realistic that it could be kept even for documentary. Actually, this very slow movie with terrible soundtrack is nothing but traditional Estonian cinema.", "transcript": [], "url": "https://subslikescript.com/movie/Karge_meri-446376"},
{"title": "Turn Around (2017) - full transcript", "plot": "After graduating from Kaohsiung Normal University, Wang Cheng-chung teacher was designated to teach in a rural - Nantou County Zhongliao Township Shuangwen Primary school which was lacking in educational resources. He was prepared to leave after the end of internship but met with the Taiwan 921 earthquake. When the students cried and asked him: \"Teacher, will you be coming back?\" Wang Cheng-chung teacher was deeply inspired by the students and decided to stay with the school which was lacking in resources for the education of rural children and efforts.", "transcript": [], "url": "https://subslikescript.com/movie/Turn_Around-6879340"},
{"title": "The Black Demon (2023) - full transcript", "plot": "Stranded on a crumbling rig in Baja, a family faces off against a vengeful megalodon shark.", "transcript": [], "url": "https://subslikescript.com/movie/The_Black_Demon-10279472"},
{"title": "Bayi Ajaib (2023) - full transcript", "plot": "A newly rich and recently married man's comfortable life threatens to crumble when his infant child is possessed by an unholy spirit with a grudge.", "transcript": [], "url": "http://subslikescript.com/movie/Bayi_Ajaib-23129678"},
{"title": "Ayalvaashi (2023) - full transcript", "plot": "A petty misunderstanding changes Thajudheen and Benny's relationship from friends to foes. Thajudheen goes above and beyond to prove his innocence but ends up making things worse for his loved ones.", "transcript": [], "url": "http://subslikescript.com/movie/Ayalvaashi-23327344"},
{"title": "The Eye 3 (2005) - full transcript", "plot": "In Thailand, Chongkwai is welcoming his friends Ted and his cousin May and Kofei and his girlfriend April from Hong Kong. While in a tourist tour, they see an accident on the road, and when they return to Chongkwai's home, they decide to tell ghost stories. Chongkwai shows them a mystic book with ten ways to see spirits and they decide to follow the procedures. When Kofei vanishes, April tries to find him, while Ted and May runs back to Hong Kong. But the spirits do not leave them and insist to play with them. Ted and May return to Thailand trying to stop seeing ghosts.", "transcript": [], "url": "http://subslikescript.com/movie/The_Eye_3-455135"},
{"title": "Take Care of My Mom (2022) - full transcript", "plot": "\"Take Care of Mom\" is all about the struggles and heartaches of an old woman and her relationship with strangers whom she treats as her family.", "transcript": [], "url": "http://subslikescript.com/movie/Take_Care_of_My_Mom-19849538"},
{"title": "Wonderful! Liang Xi Mei the Movie (2018) - full transcript", "plot": "Cross dressing as a middle aged lady for comedy is his best idea in his life and he is milking it to the last drop. The best part is that this idea is not even his own, it was blatant rip off from a Japanese comedian legend. This man has received far more credit than he deserves. And yes he is a sleeze bag that sleeps with aspiring actresses in his mini van in parking lots.", "transcript": [], "url": "http://subslikescript.com/movie/Wonderful_Liang_Xi_Mei_the_Movie-7897012"},
{"title": "I Think You're Totally Wrong: A Quarrel (2014) - full transcript", "plot": "On the first day of shooting, James Franco, David Shields, and Caleb Powell throw out the script when a real-life argument breaks out between the three of them about what can and can't be used in the film. Shields and Franco browbeat Powell to sacrifice everything for the sake of the film; Powell threatens to leave; Shields feels guilty about betraying Powell; and Franco wants Shields and Powell to confess all for the sake of the film. A debate, nearly to the death, about life and art.", "transcript": [], "url": "http://subslikescript.com/movie/I_Think_Youre_Totally_Wrong_A_Quarrel-4659082"},
{"title": "Velvet Terrorists (2013) - full transcript", "plot": "The Film maps the terrorist acts of individuals in the period of \"normalisation\" in Czechoslovakia. Their attempts, which often remained unrealized, were isolated heroic cries in the homogeneous gray mass of society. With the main theme as the background, the film looks at issues of ethics, irrationality and terrorism, its sense and deadly force in today's world. The film focuses on a trio of protagonists. The first wanted to blow up a podium during Labour Day celebrations in the 1970's. The second wanted to assassinate the President and launch an anti-Communist revolution, but his letter addressed to the CIA was so naive that he never received a response. The third destroyed billboards. At the time their acts were crimes, though today they are considered to be heroism. It is a film about relative perspectives on history and its heroes.", "transcript": [], "url": "http://subslikescript.com/movie/Velvet_Terrorists-3012834"},
{"title": "Nightmares in Precinct 7 (2001) - full transcript", "plot": "Really good horror/cop movie. A cop is celebrating his latest success. when he's called away for yet another bust. When it all goes wrong several cops are dead,and several more- including our hero are in the hospital. When our hero wakes up from a coma he finds he can now see dead people.Taking things in mostly unexpected directions this movie is a nice film with a human edge. You like the people and the ghosts and really want to know who is behind the killings in the films second half.This is a must see little film for those who want a really good atypical thriller. A real pleasure.8 out of 10", "transcript": [], "url": "http://subslikescript.com/movie/Nightmares_in_Precinct_7-313403"},
{"title": "Omotenashi (2018) - full transcript", "plot": "Jacky is the young heir to a construction company in Taiwan. His father sends him to Kyoto to oversee the renovation of a hotel they bought. Jacky is going in hopes to get back his ex-girlfriend Naoko and to sell the hotel. There, he meets the innkeeper Mistuko and her daughter Rika.", "transcript": [], "url": "http://subslikescript.com/movie/Omotenashi-5921100"},
{"title": "The Perfect Girl (2017) - full transcript", "plot": "Yeh Xin is a beautiful girl who focuses in criminal psychology research. One day, Xin's father flies to the USA for a month for a medical seminar. Their mansion is being renovated due to serious leakage. Surprisingly, several human bones and parts are dug out from the garden - While the investigation going, Xin accidentally finds hundreds of letters written by a girl named Bugzy, in her boyfriend's study room. Suspecting being cheated and being jealous; Xin begins to read the letters. She then discovers that other than Zhihuan, two other girls are also accidentally died because of Xin's boyfriend. Was it all murder? Who will survive and what will be left at the end?", "transcript": [], "url": "http://subslikescript.com/movie/The_Perfect_Girl-6985020"},
{"title": "The Need to Grow (2019) - full transcript", "plot": "The Need To GROW follows pioneers of cutting edge technology as they fight to localize sustainable food systems and regenerate Earth's dying soils.", "transcript": [], "url": "http://subslikescript.com/movie/The_Need_to_Grow-4553542"},
{"title": "Suede: The Insatiable Ones (2018) - full transcript", "plot": "Suede's arrival in British music in the 1990s was a phenomenon. Fated as 'The Best New Band in Britain' before they had even released a single, their debut album was the biggest selling for a generation and their emergence and dominance heralded Britpop. Made with full access to the band and their unexpurgated, incredible archive, Suede: The Insatiable Ones is documentary-feature that tells their story with brutal honesty, humour and dignity. Pulling no punches, the film eschews a linear form for a themed journey through Suede's intense career, and its creative and personal highs and lows. Through five chapters it explores: their roots and identity; the rush of success and immediate, infamous internal power struggle and schism, which few thought they could survive; the subsequent commercial apogee and significant international success; the resultant excess and substance abuse; their 'slow painful death' and split; and - ultimately - their recent, brilliant, acclaimed artistic rebirth. Frontman Brett Anderson and the band are joined by a wonderful cast that includes founder member of Suede and Elastica, Justine Frischmann, Suede's early manager Ricky Gervais, early Suede drummer and ex-Smith Mike Joyce, alongside friends, family and collaborators including Richard Osman, iconic designer Peter Saville, and others.", "transcript": [], "url": "http://subslikescript.com/movie/Suede_The_Insatiable_Ones-9436970"},
{"title": "Kacchey Limbu (2022) - full transcript", "plot": "A wilful young girl who is in the race of fulfilling dreams imposed on her by everyone and being at the receiving end each time.", "transcript": [], "url": "http://subslikescript.com/movie/Kacchey_Limbu-21387380"},
{"title": "Dr. Caligari (1989) - full transcript", "plot": "Mrs. Van Houten has shown signs of losing touch with reality, and her husband discusses possible treatment with Dr. Caligari, who says Mrs. Van Houten has a disease of the libido. The staff want Dr. Caligari removed from their facility due to her controversial experiments with electroshock and hypothalamus injections. As Dr. Caligari continues experimenting with her patients, her daughter and son-in-law attempt to stop her.", "transcript": [], "url": "http://subslikescript.com/movie/Dr_Caligari-97228"},
{"title": "Næsbygårds arving (1965) - full transcript", "plot": "Martin is a grandson and sole heir of Næsbygaard, where he lives with his grandfather.", "transcript": [], "url": "http://subslikescript.com/movie/Nsbygrds_arving-59526"},
{"title": "The Verdict (1946) - full transcript", "plot": "Mr. Grodman was a respected superintendent at Scotland Yard until a mistake in an investigation caused the execution of an innocent man. He takes the blame, is dismissed, and replaced by the obnoxious, gloating Buckley. Feeling vengeful, Grodman would like nothing more than to see Buckley look foolish on the job. His friend Victor Emmric, an artist with macabre tastes, wouldn't mind either and soon a mysterious murder occurs that may provide them with the chance.", "transcript": [], "url": "http://subslikescript.com/movie/The_Verdict-39080"},
{"title": "Centimeter (2023) - full transcript", "plot": "A scientist comes back home to finish his father's dream project. With the help of his friends and an A.I Humanoid, he sets up a lab inside a sacred grove and starts working on his subject Parvathy which leads to unpredictable occ...", "transcript": [], "url": "http://subslikescript.com/movie/Centimeter-14527750"},
{"title": "Kathal: A Jackfruit Mystery (2023) - full transcript", "plot": "A local politician whose prized jackfruits go missing and a young police officer who is adamant to solve this bizarre case to prove herself.", "transcript": [], "url": "http://subslikescript.com/movie/Kathal_A_Jackfruit_Mystery-18413766"},
{"title": "Safe in Hell (1931) - full transcript", "plot": "Sought by the New Orleans police for accidentally killing the man who raped her and forced her into prostitution, a woman flees New Orleans for a Caribbean island. Surrounded by lecherous criminals, she awaits the return of her fiancé and seems to be holding her own until the treachery of the local police chief leaves her but one choice to gain her freedom.", "transcript": [], "url": "http://subslikescript.com/movie/Safe_in_Hell-22335"},
{"title": "Top 10 Biggest Beasts Ever (2015) - full transcript", "plot": "Before man ruled the world, Earth was a land of giants. Count down the biggest beasts of their kind to ever roam the planet in this eye-opening original special, and uncover the secret lives of these super-sized species. Birds with plane-length wingspans, dinosaurs rivaling a Boeing 737; this stunning CGI special goes in search of the truth behind these monsters, counting down the ten largest and most extraordinary finds. From handling the recently unearthed bones of a dinosaur far larger than previously known, to analysing the flight technique of a giant seven-metre bird -uncover the unique adaptations that allowed each animal to thrive. Visual stunts and surprising size comparisons bring each beast vividly back to life in ever-increasing sizes. Get ready for a dramatic countdown of the most mind-blowing lost giants.", "transcript": [], "url": "http://subslikescript.com/movie/Top_10_Biggest_Beasts_Ever-4769024"},
{"title": "2,215 (2018) - full transcript", "plot": "A documentary based on true story of thai singer named \"Artiwara Kongmalai\", who dedicates himself to long-running from Betong, Yala district, South of Thailand to Mae sai, Chiang Rai, North of Thailand. It takes 2 215 kilometres which is documentary's name and 55 days from the first november 2017 to the end. He tries to collect money devoted by Thailand's people as much as possible in order to help several hospitals to import medicals equipments needed, which is the purpose of this long-running event.", "transcript": [], "url": "http://subslikescript.com/movie/2215-8891536"},
{"title": "My Indian Boyfriend (2021) - full transcript", "plot": "It's a love story between a Hong Kong girl and an Indian boy, set in Hong Kong. It encapsulates the drama of conflicts caused by racial discrimination as well as differences in social-cultural, lifestyle, and family values. At the same time, it combines the emotions of tears, joy, and humor with song and dance.", "transcript": [], "url": "http://subslikescript.com/movie/My_Indian_Boyfriend-14764886"},
{"title": "Neelavelicham (2023) - full transcript", "plot": "A young, enthusiastic and free-spirited writer arrives to stay in a desolate mansion, rumored to be haunted by the apparition of a young woman who committed suicide when she was betrayed in love.", "transcript": [], "url": "http://subslikescript.com/movie/Neelavelicham-13886392"},
{"title": "All My Goddess (2017) - full transcript", "plot": "When Jia Xin runs away from her wedding, her friends are forced to come to terms with their own personal issues.", "transcript": [], "url": "http://subslikescript.com/movie/All_My_Goddess-7159010"},
{"title": "Kill Mobile (2018) - full transcript", "plot": "A group of seven friends decide to play a game at a dinner party. Placing each of their phones on the table, they agree to share the content of every message they receive. However, it soon appears that this is going to be no normal evening.", "transcript": [], "url": "http://subslikescript.com/movie/Kill_Mobile-9408490"},
{"title": "Lion Rock (2019) - full transcript", "plot": "In 2011, Lai Chi-wai - one of the top rock climbers in Asia - lost everything when a motorcycle accident took away his ability to walk. Rather than succumbing to his fate, Lai found his own way of scaling those dizzying peaks again. With his second feature, Nick Leung offers a remarkable change of pace, eschewing the macabre humour of his debut Get Outta Here for an inspiring and touching tale about how a human being overcomes adversity. Featuring a career-best performance from Alex Lam as the wheelchair-bound athlete, this incredible fact-based story is a rousing tribute to Hong Kong's never-say-die spirit.", "transcript": [], "url": "http://subslikescript.com/movie/Lion_Rock-11811996"},
{"title": "Make It Big Big (2019) - full transcript", "plot": "Areality comedy that delves into the secret lives of the leading four radio-presenters, detailing how these celebrities deal with living in the public eye, meeting the daily expectations of their fans and their personal issues.", "transcript": [], "url": "http://subslikescript.com/movie/Make_It_Big_Big-9420498"},
{"title": "Agent Crush (2008) - full transcript", "plot": "To fight crime, a new hero is created, but there are a few small glitches to iron out.", "transcript": [], "url": "http://subslikescript.com/movie/Agent_Crush-815096"},
{"title": "Kôshoku: Genroku (maruhi) monogatari (1975) - full transcript", "plot": "An ironic and tragic story about the love adventures of young Natsu and her married sister Oshichi. Love gives them a chance to escape a decaying house. Natsu's cynicism and practicality contrasts with Oshichi's naivety and selfle...", "transcript": [], "url": "http://subslikescript.com/movie/Kshoku_Genroku_maruhi_monogatari-143518"},
{"title": "Il caso Moro (1986) - full transcript", "plot": "On March 16th 1978, the Red Brigades kidnap Aldo Moro, the former Italian Prime Minister and the leader of Christian Democrats, the party in power in Italy since the end of the war. Fifty-five days later, his corpse was found in the centre of Rome in the trunk of a red Renault. Not only was Moro the victim of the brigadists but also of the struggle for power between the Italian political parties.", "transcript": [], "url": "http://subslikescript.com/movie/Il_caso_Moro-90805"},
{"title": "Mass (2004) - full transcript", "plot": "Vizag city is plagued by a mafia gang, headed by the most powerful mafia don Satya (Raghuvaran). Satya, who is physically disabled, is the mastermind while his son Seshu (Rahul Dev) implements those strategies with his muscle. Together they make a terrific combination Ganesh (Nagarjuna) enters Vizag and settles in an apartment. After noticing the menace by Satya's henchmen, Ganesh calls up Seshu and warns him about four dates of that month - 15th, 20th, 25th and 1st (next month). He would harm and cause damage to them for 3 dates and finally would put an end to the life of Seshu on the 1st. The rest of the film is all about how Nagarjuna implements his strategies to scare the gang and the reason behind Nagarjuna's mission of coming to Vizag.", "transcript": [], "url": "http://subslikescript.com/movie/Mass-445033"},
{"title": "Tom Hanks: The Nomad (2023) - full transcript", "plot": "From humble beginnings to an aspiring thespian to acting as some of the world's most iconic and notable characters. He has picked up a reputation as 'America's Nice Guy', 'The Everyman' and a nomad of the arts. But we all know him...", "transcript": [], "url": "http://subslikescript.com/movie/Tom_Hanks_The_Nomad-26688393"},
{"title": "Not of This Earth (1988) - full transcript", "plot": "A science fiction vampire movie. The Vampire is an emissary from an embattled world near destruction who teleports to Earth to see if they can live here. He finds that our blood is nourishing and that at least one source of it is a steady stream of transfusions. He hypnotizes a Dr. to provide them and has his blond nurse move in to administer them.", "transcript": [], "url": "http://subslikescript.com/movie/Not_of_This_Earth-95756"},
{"title": "Tarzan in the Golden Grotto (1969) - full transcript", "plot": "Zan (Tarzan in some subtitled versions) helps the Amazons defeat two gangsters who wished to take over a sacred gold treasure from the women's tribe. There are extensive views of the Central America jungle, and several tough battles between the young Amazons and the evil pirates.", "transcript": [], "url": "http://subslikescript.com/movie/Tarzan_in_the_Golden_Grotto-65071"},
{"title": "Murder in the Orient (1974) - full transcript", "plot": "During World War II, When the Japanese were fighting in the Philippines, they buried a stash of gold. They decided to abandon the traditional \"treasure map\", deciding instead to engrave directions to the loot on two separate samurai swords. Now, in the swingin' seventies, the nefarious Golden Cobra Gang has one of the swords. They desperately want the other one. Gustavo, a higher-up in the organization, really wants to please the head boss, King Cobra, so he pulls out all the stops to get the missing sword: he brings in Kang the Butcher, a ruthless assassin, and of course Turko. But he makes a fatal error in his quest. He kills the sister of Lao Tsu (Leo Fong). Now Tsu, a peaceful Hong Kong martial arts instructor, must travel to Manila to get revenge. On top of that, the American Paul Martelli (Ron Marchini) is caught up in the madness because he was involved with Tsu's sister.", "transcript": [], "url": "http://subslikescript.com/movie/Murder_in_the_Orient-196771"},
{"title": "Timemaster (1995) - full transcript", "plot": "Young Jesse travels through time trying to stop a bunch of evil, virtual, fight managers from destroying Earth.", "transcript": [], "url": "http://subslikescript.com/movie/Timemaster-114676"},
{"title": "Kiss Napoleon Goodbye (1990) - full transcript", "plot": "Tension erupts when a couple shares their secluded hideaway with a visiting friend.", "transcript": [], "url": "http://subslikescript.com/movie/Kiss_Napoleon_Goodbye-1368863"},
{"title": "Forgotten Warrior (1986) - full transcript", "plot": "Steve Parrish (Ronald Marchini) is fighting in Vietnam in 1974. He is injured and after a six-month recovery in a small village, he decides to stay behind and marry a local woman. He teaches the whole village martial arts including a small boy who resembles Scott Baio and has the fan favorite bowl haircut.", "transcript": [], "url": "http://subslikescript.com/movie/Forgotten_Warrior-291913"},
{"title": "Dialing for Dingbats (1989) - full transcript", "plot": "A lonely man finds love through a party line.", "transcript": [], "url": "http://subslikescript.com/movie/Dialing_for_Dingbats-375706"},
{"title": "Silent but Deadly (1986) - full transcript", "plot": "America's first black, Jewish and female president must save the nation from a smelly and lethal threat.", "transcript": [], "url": "http://subslikescript.com/movie/Silent_but_Deadly-2112267"},
{"title": "Savannah Electric (1985) - full transcript", "plot": "On a post-apocalyptic world, a mobile desert factory (Savannah Electric) run by the first thinking machine (The Benefactor), scavenges the last remnants of civilization. Amidst the ecological blight, a clone worker (Gerit Stone) attempts to escape the grip of the machine and psycho-addictive virtual reality device (The SuperInducer), in a half-conscious attempt to regenerate the frontier into what it had once been. In response, The Benefactor dispatches a bounty hunter (H. A. Roc) to eliminate the rogue worker before he can succeed.", "transcript": [], "url": "http://subslikescript.com/movie/Savannah_Electric-15077468"},
{"title": "Beautiful People (1974) - full transcript", "plot": "Hilarious documentary on the wildlife of the Namib Desert.", "transcript": [], "url": "http://subslikescript.com/movie/Beautiful_People-71143"},
{"title": "Ukraine Is Not a Brothel (2013) - full transcript", "plot": "Ukraine's topless feminist sensation Femen has stirred up a press frenzy across Europe. Outraged by the world's image of Ukrainian women as either brides for sale or commodities of sex tourism, Femen bare their breasts in protest in order to disrupt this perception and agitate these brutal patriarchal forces. Now, for the first time, 'Ukraine Is Not A Brothel' offers an intimate glimpse inside the world's most provocative feminist organisation. A movement that began in the snow-filled streets of a corrupt, post-Soviet Ukraine, Femen's naked war against patriarchy is gaining momentum across Europe. But before they take the world by storm, these bold and beautiful women must first confront the perverse and contradictory forces that power their own 'titillating' feminist organisation.", "transcript": [], "url": "http://subslikescript.com/movie/Ukraine_Is_Not_a_Brothel-3136842"},
{"title": "Virupaksha (2023) - full transcript", "plot": "Mysterious deaths occur in a village due to an unknown person's occult practices. The whole town is afraid, and the problems continue as they search for the one responsible.", "transcript": [], "url": "http://subslikescript.com/movie/Virupaksha-24059780"},
{"title": "Creepypasta (2023) - full transcript", "plot": "Trapped in an abandoned house, a nameless man desperately searches for clues to how he got there. The answer is hidden within a series of disturbing viral videos - each of which begins to infect his mind.", "transcript": [], "url": "http://subslikescript.com/movie/Creepypasta-12971854"},
{"title": "Burning Days (2022) - full transcript", "plot": "Emre, a young prosecutor newly appointed to the small town of Yaniklar, finds himself being pulled into a political conflict during his first criminal investigation.", "transcript": [], "url": "http://subslikescript.com/movie/Burning_Days-14859416"},
{"title": "Bröllopsfotografen (2009) - full transcript", "plot": "When the factory in Molkom shuts down, Robin leaves his beloved hometown to try his luck in Stockholm as a wedding photographer. This experience changes not merely his outlook on life but also his hairstyle.", "transcript": [], "url": "http://subslikescript.com/movie/Brllopsfotografen-1359421"},
{"title": "Rise of the Legend (2018) - full transcript", "plot": "The movie tells the inspirational story of Malaysia's badminton legend, Lee Chong Wei. Born in a poor family, he never gave up despite the difficulties he went through. His determination led to him becoming the professional badminton player and national hero that he is today.", "transcript": [], "url": "http://subslikescript.com/movie/Rise_of_the_Legend-7967954"},
{"title": "The Gangs, the Oscars, and the Walking Dead (2019) - full transcript", "plot": "Producer BS and his long time director friend Wenxi have always dreamy to make it big in movie industry. The duo has been working together for more than a decade, but nothing's ever successful. They treat the filming of ceremonies, weddings and funerals like shooting a movie, with drones and all, but they still struggle financially. They even work for the mob to pay their debts. One day, their creditor and the mob boss Brother Long suddenly takes an interest in Wenxi's script. He only has one condition: to let his wife Shanny be the leading actress. Their chance finally comes.", "transcript": [], "url": "http://subslikescript.com/movie/The_Gangs_the_Oscars_and_the_Walking_Dead-11070468"},
{"title": "Darkeplica (2023) - full transcript", "plot": "Penelope obsessed with finding her children world crumbles as she succumbs to emotional stress and the silent voices of her new reality. Her husband believes she has lost her mind and watches her deteriorate into a world of darkness.", "transcript": [], "url": "http://subslikescript.com/movie/Darkeplica-27450106"},
{"title": "Malibu High (1979) - full transcript", "plot": "High-school student Kim is having a tough time: her boyfriend Kevin dumped her for rich girl Annette, her grades are slipping, she has no money, and all her mother seems to care about is cleaning. She tells her best friend Lucy that the nonsense ends today. She's been feeling sorry for herself ever since her father hanged himself. She begins working for Tony the pimp and things start to look better for her: new clothes, new car, and good grades. Kevin notices her again and Annette hates her. She then meets Lance, who frees her from turning tricks in a beat-up old van, which leads her to better clothes and nicer cars. Prostitution isn't the worst of it as she is forced to kill a man in self-defense when he tries to have his way with her being tied up. She becomes a hit woman.", "transcript": [], "url": "http://subslikescript.com/movie/Malibu_High-79514"},
{"title": "Fast X (2023) - full transcript", "plot": "Dom Toretto and his family are targeted by the vengeful son of drug kingpin Hernan Reyes.", "transcript": [], "url": "http://subslikescript.com/movie/Fast_X-5433140"},
{"title": "Little Hero (2018) - full transcript", "plot": "LITTLE HERO is about a young boy's quest to save his father from an ancient monster. When BAYU finds a sword, he accidentally awakens the giant evil Asura who turns everyone in the village to stone including his father. With his cousin Raney alongside, Bayu must find six Ancient Knights who carry amulets that will give Bayu the power to battle Asura and save his father and friends in the village.", "transcript": [], "url": "http://subslikescript.com/movie/Little_Hero-7989512"},
{"title": "Let's Cheat Together (2018) - full transcript", "plot": "Sleuth Cheng, the host of the variety show, Love Is Magic, is specialised in advising the audiences on relationship problems. One early morning, he is found buried inside a tetrapod on the beach while the secretly filmed clip of Cheng passionately kissing the mayor's wife goes viral on the Internet with millions of views. It not only drops a bomb in the Taiwanese politics but has a profound impact on the upcoming mayoral election. The hospital is besieged by journalists. Cheng, whose body is covered with injuries, and his girlfriend, who works as his agent, confess that they are entrusted with a secret mission by the Taipei Mayor. It turns out that Cheng is asked to sort out the mayoress's affairs and to help the mayor control the situation before the election. In an exclusive membership-only club where privacy is absolutely protected, Cheng observes the series of affairs the mayoress has had and comes to realise that these relationships are far more complicated than they appear. In fact, the mayoress suffers greatly from the insolvable problems in her marriage. During the process, Cheng gradually warms towards the mysterious mayoress and slowly walks into a love trap full of lies and calculation. Cheng's reputation is in ruins. Under the gaze of the bloodthirsty media, how could Cheng escape from this farcical political storm? Moreover, what unspeakable secrets that would shake the whole country does the mayoress hold?", "transcript": [], "url": "http://subslikescript.com/movie/Lets_Cheat_Together-8973520"},
{"title": "Take 2 (2017) - full transcript", "plot": "'Take 2' weaves a story of four ex-cons struggling to reintegrate into society – Ryan Lian's Tiger is a former gangster who took the rap for his boss Blackie (Henry Thia); Wang Lei's Mad Dog is a serial criminal who has apparently been convicted of every single offence in the Penal Code except for 'unnatural sex'; Gadrick Chen's Panther was betrayed by his partner during a robbery attempt; while Maxi Lim's Jian Ren was a soon-to-be groom convicted of sex with an underage prostitute during his bachelor's night party – and Tiger's voice-over at the beginning sums up their collective willingness to turn over a new leaf following their most recent prison stints. It was just last year that K. Rajagopal's 'A Yellow Bird' dwelt on similar themes, and slightly more than a decade ago that Jack Neo had done likewise with 'One More Chance', but 'Take 2' is intended less as a serious drama on new beginnings and second chances than as a light-hearted dramedy with the same subject matter for the Chinese New Year season.Co-written with his 'Ah Boys to Men' director Neo, Ivan Ho (who also makes his directorial debut here) himself struggles to strike the right balance between humour and seriousness, exacerbated by the blatant repetition of casting a cross-dressing Dennis Chew in a variety of bit roles. There is Dennis Chew as an egotistical 'auntie' whose car Panther had leased for use as a private taxi; there is Dennis Chew as the owner of a tuition centre who offers Jian Ren a teaching position without knowing of his past conviction; there is Dennis Chew as the female boss of a 'bak chor mee' stall whose quarrel with Mad Dog goes viral; and there is Dennis Chew as a beggar who bursts into church with face shrouded in shadow looking like Jesus Christ. As much as Chew doesn't attempt to steal the limelight in each one of these scenes, his presence alone ultimately distracts from the intended message of the stigmatization that these ex-cons face while trying to get back on their feet, even at times trivializing their very predicaments.Among the quartet, only Tiger emerges as a fully enough formed character that we come to empathise with, especially as he tries in vain to get through to his estranged teenage son Guang (newcomer Shawn Ho) who appears to be following in his younger day's footsteps. Whereas, Panther and Mad Dog's presence seem to go not much further than as comic sidekicks, and Jian Ren is (well) almost completely sidelined. It should also come as no surprise that, among them, Lian's performance is easily the most gripping, injecting some much-needed gravitas into a film that would otherwise come off too lightweight for its own good. Graduating from his scene-stealing supporting part in Neo's epic period drama 'Long Long Time Ago' into the lead role here, Lian also holds his own against veteran actor Chen Tianwen, who sheds his 'Mr Unbelievable' persona for a truly menacing villainous part named Di Tie with his own score to settle with Tiger.Oh yes, as formula would have it, Di Tie represents the past that comes back to haunt our four flawed heroes just as they are about to make a breakthrough with a new business venture that combines Tiger's cooking talent with Jian Ren's excellent Maths teaching skills and Panther's entrepreneurial instincts. Bearing the film's titular name, the three-in-one establishment offers tuition services for kids with food and beverage options and massage services for their waiting parents. And yet, that promising restart threatens to be derailed by Di Tie, who not only exploits Mad Dog (who owes him money he borrowed to feed his gambling habit) to spike the establishment's water on its opening day but also Guang to frame his father for drug possession, thus culminating in a showdown at a warehouse pier that you've probably seen the trailers teased.Whereas the earlier two acts alternated between comedy and drama, the last adds action into the mix – what with Mad Dog dusting off his former 'choppers' inscribed with his former nickname 'Geylang Mad Dog' (prompting one of the genuinely funny quips from Blackie that he had ORD-ed from gangster-hood without 'returning his arms') and Panther packing a fire extinguisher, a washing basin, a pair of nanchucks and rope to stage an ambush on MRT and his gang. The ensuing mishmash is as discordant as it sounds, vacillating between melodramatic scenes of Tiger fending off MRT's brutal attack for the sake of Guang and amusing scenes of nerdy Jian Ren transforming into a 'nanchucks' expert as well as Panther channeling his inner Bruce Lee. And yet, there is undeniably a scrappy charm to the proceedings, driven by the chemistry between Lian, Wang and Chen that translates into a palpable sense of brotherhood between their characters on screen.That 'Take 2' proves to be somewhat rough around the edges is perhaps to be expected, given how this is only Ho's maiden outing behind the camera. His background as a writer no doubt makes his debut feature a lot more narratively coherent than some of Neo's earlier works, but as a director, Ho seems to have adopted his mentor's sitcom-ish style despite trying to infuse a more urbane flair with the use of Latin tunes like Gabriel Saientz's 'Te Quiero'. As far as inspiring its audience to give ex-cons in society a 'take two', 'Take 2' isn't nearly as moving or poignant as it needs to be; but as comedy fare for the Chinese New Year season, there is enough humour, wit and even sheer nuttiness to keep you engaged, if not entertained. Just as how it is not realistic for ex- cons to keep their old ways while starting over, 'Take 2' cannot be both goofy and compelling at the same time, so it is no surprise that it ultimately comes off more of the former and much less of the latter.", "transcript": [], "url": "http://subslikescript.com/movie/Take_2-6441310"},
{"title": "Papaw Land (2021) - full transcript", "plot": "A troubled teenager spends the summer with his grandfather in the Ozarks, where he's free from his mother, but not her painful past.", "transcript": [], "url": "http://subslikescript.com/movie/Papaw_Land-13844108"},
{"title": "King of Mahjong (2015) - full transcript", "plot": "A family comedy set in modern times, KING OF MAHJONG illustrates how friendship among kampong kakis (\"buddies\") and love between family members underscore all ambitions and desire for power. Movie viewers can expect the boisterous characters to generate loads of witty, well-timed, jokes and look forward to lots of lively repartee.", "transcript": [], "url": "http://subslikescript.com/movie/King_of_Mahjong-4415076"},
{"title": "Forever (2010) - full transcript", "plot": "Joey, a talented video consultant, shares the art of marrying a man through her romantic 'faux' wedding videos, which are screened to young singles all over Singapore. The idea of fantasy and reality is blurred when she falls madly in love with a handsome music teacher from Taiwan who appeared with her in a landmark wedding video. While Gin claims his affection for her was strictly for the video, Joey pursues him to make him see that she is his true bride. Will her relentless drive to restore the happiness and joy she once knew be her ultimate failing and undoing?", "transcript": [], "url": "http://subslikescript.com/movie/Forever-1554514"},
{"title": "High Flash (2018) - full transcript", "plot": "Fisherman Ah-Hai is found dead from self-immolation during a large-scale protest against TL Petrochemical. The incident instantly makes media headlines; Ah-Hai is hailed as a martyr. Medical examiner Chou is assigned to the case with public prosecutor Kim, his ex-fiancée. When the two discover evidence of murder and a major conspiracy, Chou breaks protocol to conduct his own investigation in order to protect Kim. As the truth is gradually revealed, the case and their past start to intertwine.", "transcript": [], "url": "http://subslikescript.com/movie/High_Flash-8463258"},
{"title": "Flutter (2014) - full transcript", "plot": "Johnathan is a nine-year-old boy who loves sea monsters, and his 300 lb. pet pig, named Wee Wee. Unlike most kids, Johnathan has nystagmus, which makes his eyes \"flutter.\" He also suffers from severe narrow angle glaucoma; an acute condition that if untreated can lead to permanent blindness. JoLynn cares for Johnathan alone while her singer/songwriter husband David travels in search of his big break. To treat Johnathan, she grows hydroponic marijuana to relieve the painful intraocular pressure Glaucoma causes. She cooks the marijuana into brownies and feeds them to him in secret. David's parents, Mark and Linda, live nearby and provide for JoLynn and Johnathan as best they can on a fixed income. Linda is highly critical of JoLynn's ability to raise Johnathan. During her son's absence, Johnathan has become more undisciplined than Linda would like. While Mark tries to keep the peace, he is torn between his wife and their daughter-in-law, who he loves deeply. When JoLynn discovers that Linda is secretly mounting a case for legal custody of Johnathan, JoLynn is forced to forgo the support of her in-laws. The result is a spiral of desperate acts that force JoLynn to make a decision that will change Johnathan's world forever.", "transcript": [], "url": "http://subslikescript.com/movie/Flutter-2409812"},
{"title": "Ace of Sales (2016) - full transcript", "plot": null, "transcript": [], "url": "http://subslikescript.com/movie/Ace_of_Sales-6121536"},
{"title": "Bad Boy Symphony (2019) - full transcript", "plot": "Young criminal Lei, after failing his repeated attempts to escape from prison, joins a classical music ensemble, taught by a teacher who is helping the criminals there turn over a new leaf by preparing them for a music contest. Unfortunately for Lei, he finds out that his bandmates are newbies when it comes to music.", "transcript": [], "url": "http://subslikescript.com/movie/Bad_Boy_Symphony-10414750"},
{"title": "Sandwich (2023) - full transcript", "plot": "A newly wed couple invites a woman for threesome. Unknown to them someone is watching their sexcapade. When the threesome becomes foursome, that's when chaos begins.", "transcript": [], "url": "http://subslikescript.com/movie/Sandwich-27724343"},
{"title": "23:59: The Haunting Hour (2018) - full transcript", "plot": "No army is safe from hell. Recruit Tommy - a socially awkward individual, is the subject of teasing and bullying by his army mates. He seeks comfort from the compliments left by his readers on his blog that features fictitious army horror stories he writes in his free time. Tommy's articles were well received by his readers, from the story of a sinister spirit that haunts the pioneer batch of National Service cadets enlisted in 1967; to the strange encounters of a commando unit in 1983, believed to be the doings of a vengeful, seductive python spirit. Among the messages received, an attractive reader who praised Tommy for his article caught his eyes. Mesmerized by her looks, Tommy imagines being in a relationship with her and even doctored pictures of them together. One day, he received a text message from her and things started to go awry.", "transcript": [], "url": "http://subslikescript.com/movie/2359_The_Haunting_Hour-8657692"},
{"title": "12:46 (2023) - full transcript", "plot": "In exchange for getting his album financed, Ray agrees to drive for his gangster friend, determined to eliminate a rival gang. As the body count rises, Ray must choose between loyalty and love after finding out his girlfriend is p...", "transcript": [], "url": "http://subslikescript.com/movie/1246-27542403"},
{"title": "Let's Sing (2021) - full transcript", "plot": null, "transcript": [], "url": "http://subslikescript.com/movie/Lets_Sing-25148382"},
{"title": "Exorcism in Utero (2023) - full transcript", "plot": "It tells the story of a woman who must save her unborn child and herself when she is possessed by a powerful ring.", "transcript": [], "url": "http://subslikescript.com/movie/Exorcism_in_Utero-22206842"},
{"title": "Where Life Begins (2022) - full transcript", "plot": "The story of a young Haredi woman and a divorced farmer who both long to break free.", "transcript": [], "url": "http://subslikescript.com/movie/Where_Life_Begins-15198986"},
{"title": "India's Partition: The Forgotten Story (2017) - full transcript", "plot": "In this documentary, British film-maker Gurinder Chadha, director of Bend It Like Beckham and Viceroy's House, travels from Southall to Delhi to find out about the Partition of India - one of the most seismic events of the 20th century. Partition saw India divided into two new nations - independent India and Pakistan. The split led to violence, disruption and death. To find out why and how it happened, Gurinder crosses India, meeting people whose lives were torn apart by Partition and talking to historians who explain the motivations behind the split. Along the way, she discovers that Partition was caused by politicians who were more interested in their own power than in Indian unity, and finds out that the British also played a major role in the Partition.", "transcript": [], "url": "http://subslikescript.com/movie/Indias_Partition_The_Forgotten_Story-11560018"},
